//
//  sooreh.swift
//  Mafatih
//
//  Created by Mahdi on 13/08/2015.
//  Copyright (c) 2015 Mahdi Irandoost. All rights reserved.
//

import UIKit

class ziyarat : UIViewController , UITableViewDelegate , UITableViewDataSource {
    
    
    @IBOutlet weak var tableView: UITableView!
    
    let swiftBlogs = ["سوره عنکبوت" ,"سوره روم" ,"سوره دخان" ,"سوره یس", "سوره الرحمن" , "سوره واقعه", "سوره ملک","سوره انسان","سوره نبا","سوره اعلی","سوره شمس","سوره قدر","سوره زلزله","سوره عادیات","سوره تکاثر","سوره کافرون","سوره نصر","سوره اخلاص","سوره فلق","سوره ناس"]
    
    
    
    let swiftblogo = [ "salam", "sd"]
    
    
    let textCellidentifier = "textCell4"
    
    let blogSegueIdentifier = "man4"
    
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        
        tableView.delegate = self
        tableView.dataSource = self
        
    }
    
    
    override func prepareForSegue(segue: UIStoryboardSegue, sender: AnyObject!) {
        if ( segue.identifier == "man4")  {
            let svc = segue.destinationViewController as? ziyarat2;
            let cel = sender as! UITableViewCell
            let selectedRow = tableView.indexPathForCell(cel)!.row
            svc!.tr = cel.textLabel?.text
            
            
            
        }
        
    }
    
    
    let data = [
        ["مقدمه در آداب سفر", "خبر صافی خادم امام هادی(ع) و مسافرت او به مشهد مقدس", "آداب مسافرین"]
        ,
        ["در آداب زیارت", "کلامی در زیارت زن ها و مذمت مزاحمت ایشان با نامحرمان"]
       ,
        ["اذن دخول حرم های شریفه","اذن دخولی دیگر"]
    
    ,
        ["فضیلت زیارت حضرت سول خدا و فاطمه زهراء و ائمه بقیع صلوات الله علیم اجمعین","اعمال زیارت حضرت رسول(ص)","اعمال روضه منوره","زیارت خضرت فاطمه(س)","زیارت حضرت سول(ص) از بعید","صلوات و سلام بر حضرت سول(ص) و فضیلت آن","زیارت ائمه بقیع علیهم السلام","قطعه ای از قصیده ازری","زیارت ابراهیم بن رسول الله(ص)","زیارت جناب فاطمه بنت اسد والده حضرت امیرالمومنین(ع)","زیارت حضرت حمزه رضی الله عنه در احد","فضیلت زیارت حمزه سلام الله علیه","زیارت قبور شهداء احد رضوان الله علیهم","ذکر مساجد معظمه در مدینه منوره","زیارت وداع حضرت سول(ص)","تکالیف زوار در مدینه طیبه"]

        ,
        ["در فضیلت و کیفیت زیارت مولای ما حضرت امیرالمومنین(ع)","ظاهر شدن قبر آن حضرت در زمان هارون الرشید","قصه احمی من مجیر الجراد","کیفیت زیارت حضرت امیرالمومنین","دعاهای بعد از زیارت حضرت امیر(ع)","زیارت سر امام حسین(ع) در نزد قبر امام علی(ع)","زیارت امین الله","زیارت سوم","زیارت چهارم و پنجم","زیارت ششم","زیارت هفتم","آمدن حضرت امام زین العابدین(ع)","ذکر وداع امیرالمومنین(ع)","زیارت محصوصه حضرت امیر(ع) در روز غدیر","زیارت دیگر حضرت در روز غدیر","زیارت حضرت امیرالمومنین در روز مولود","در اتحاد امیرالمومنین(ع) با پیامبر(ص)"]
,
        ["فضیلت مسجد کوفه","اعمال مسجد کوفه","نماز حاجت در مقام نوح(ع)","مناجات حضرت امیرالمومنین(ع)","کیفیت نماز حاجت در مسجد کوفه","زیارت جناب مسلم بن عقیل قدس الله روحه"]

        ,["فضیلت و اعمال مسجد سهله","اعمال مسجد زید","مسجد صعصعه"]

        ,
        ["فضیلت زیارت امام حسین(ع)","آداب زیارت امام حسین(ع)","دعا در حرم امام حسین(ع)","صلوات بر امام حسین(ع)","در اعمال حرم امام حسین(ع)","دعای وداع با امام حسین(ع)","کیفیت زیرات امام حسین(ع)","زیارت دوم و سوم امام حسین(ع)","زیارت چهارم و پنجم و ششم امام حسین(ع)","زیارت هفتم زیارت وارث","بیان آنچه زیاده شده بر زیرات وارث","پر مجعولیت دعای حبی و امثال آن ","طعن در مداخله کردن  در مکتب حدیث و اخبار و ادعیه","زیارت حضرت عباس(ع)","مرثیه ام البنین مادر حضرت عباس(ع)","زیارات مخصوصه امام حسین(ع)","دوم زیارات در نیمه رجب","سوم زیارت در نیمه شعبان","ونجم زیارت امام حسین(ع) در عید فطر و قربان","ششم زیارت امام حسین(ع) در روز عرفه","هفتم زیارت عاشورا","متن زیارت عاشورای معروفه","دعای صفوان معروف به دعای علقمه","فوائد مداومت زیارت عاشورا","دوم زیارت عاشوراء غیر معروفه","هشتم زیارت اربعین","اوقات شریفه زیارت امام حسین(ع)","فوائد و آداب تربت مقدسه"]

        ,
        ["فضیلت زیارت کاظمین علیهما السلام","زیارت امام موسی کاظم(ع)","زیارت مختص به امام محمدتقی(ع)","کیفیت زیارت کاظمین علیما  السلام","حکایت حاج علی بغدادی","فضیلت مسجد شریف براثا","زیارت نواب اربعه رضا الله عنهم","فضیلت محمد بن یعقوب کلینی عطرالله مرقده","فضائل جناب سلمان رضی الله عنه","کیفیت زیارت جناب سلمان رضی الله عنه","مرور حضرت امیرالمومنین(ع) به طاق کسری","زیارت جناب حذیفه بن الیمان در مدائن"]
,
        ["فضیلت مولانا ابوالحسن علی بن موسی الرضا صلوات الله علیه","کیفیت زیارت اما رضا(ع)","دعای بعد از زیارت امام رضا(ع)","وداع حضرت رضا(ع)","فضیلت نماز جعفر در حرم اما رضا(ع)","ورود حضرت اما رضا(ع) به قم در سفر خراسان","پیاده رفتن شاه عباس به مشهد","اشعار جامی در مدح امام رضا(ع)"]
,
        ["زیارت اسمه سر من رای(علیهم السلام) و اعمال سرداب مطهر","زیارت اما عای النقی(ع)","زیارت امام حسن عسکری(ع)","زیارت والده امام  قائم(عج)","زیارت جناب حکیمه دختر اما محمد تقی(ع)","جلالت حسین پسر امام علی النقی(ع)","جلالت سید محمد قرزند امام هادی(ع)","وداع عسکریین علیهماالسلام"]
        ,
        
        ["زیارت آل یس","زیرات حجة ابن الحسن(عج)","اعمال سرداب غیبت","زیارت دیگر برای امام زمان(عج)","ذکر صلوات بر آن حضرت","دعای عظم البلاء","دعای ندبه","زیارت حضرت حجة بعد از نماز صبح","دعای عهد","دعا برای امام عصر(عج)"]

        ,
        ["زیارت جامعه صغیره","زیارت جامعه کبیره","حکایت سید رشتی پ تشرف او","زیارات جامعه","ذعای بعد از زیارات","صلوات بر حجج طاهره علیهم السلام"]

        ,
        ["زیارات امام زارگان عظام","زیارت حضرت فاطمه معصومه(س)","زیارت حضرت عبدالعظیم(ع)","زیارت حضرت امامزاده حمزه(ع)","در زیارت قبور مومنین","تاکید فرستادن هدیه برای مردگان","عبرت گرفتم از اموات"]



    
    
    
    
    ]
    
    
    func numberOfSectionsInTableView(tableView: UITableView) -> Int {
        return data.count
    }
    
    func tableView(tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return data[section].count
    }
    
    func tableView(tableView: UITableView, cellForRowAtIndexPath indexPath: NSIndexPath) -> UITableViewCell {
        
        let cellText = data[indexPath.section][indexPath.row]
        let cell = tableView.dequeueReusableCellWithIdentifier(textCellidentifier, forIndexPath:indexPath) as! UITableViewCell
        cell.textLabel?.text = cellText
        return cell
        //  Now do whatever you were going to do with the title.
    }
    
    
    
    
    let headerTitles = [
        "آداب سفر"
        ,
        "فصل اول : آداب زیارت"
 ,
        "فصل دوم: اذن دخول حرم های شریفه"
        ,"فصل سوم: زیارت حضرت سول و فاطمه و ائمه بقیع صلوات الله علیهم"
        ,"فصل چهارم: زیارت حضرت امیرالمومنین"
        ,"فصل پنجم: فضیلت و اعمال مسجد کوفه"
        ,
        "فصل ششم: فضیلت و اعمال مسجد سهله"
     ,
        "فصل هفتم: فضیلت زیارت حضرت سیدالشهداء(ع)"
        ,
        
        "فصل هشتم:‌زیارت امام موسی کاظم(ع) و امام محمد تقی(ع)"
        
    ,
       "فصل نهم: زیارت مولانا ابوالحسن علی بن موسی الرضا(ع)"
        ,
        
        "فصل دهم: در زیارت ائمه سر من رای(علیهم السلام)"
        
        ,
        
        "فصل زیارات مولانا القائم(عج)"
        ,
        
        "فصل در زیارات جامعه"
,
        
         "خاتمه: انبیا< و امامزادگان و زیارت قبو مومنین"
        
    
    
    
    
    
    
    ]
    
    
    func tableView(tableView: UITableView, titleForHeaderInSection section: Int) -> String? {
        if section < headerTitles.count {
            return headerTitles[section]
        }
        
        return nil
    }
    
    
    
    
    
    
    
    
    
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    
    
    
}